# Pandas - DataFrames Part 2

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [7]:
df  > 0

       W      X     Y      Z
A   True   True  True   True
B   True   True  True  False
C  False  False  True  False
D   True   True  True  False
E   True  False  True   True

In [11]:
booldf = df > 0

In [12]:
booldf

       W      X     Y      Z
A   True   True  True   True
B   True   True  True  False
C  False  False  True  False
D   True   True  True  False
E   True  False  True   True

In [13]:
df[booldf]

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646       NaN
C       NaN       NaN  0.484752       NaN
D  1.901755  0.238127  1.996652       NaN
E  0.196800       NaN  0.000366  1.025984

In [14]:
df[df > 0]

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646       NaN
C       NaN       NaN  0.484752       NaN
D  1.901755  0.238127  1.996652       NaN
E  0.196800       NaN  0.000366  1.025984

In [15]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [16]:
df['W']

A    0.390528
B    0.072960
C   -0.754070
D    1.901755
E    0.196800
Name: W, dtype: float64

In [17]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [18]:
df[df['Z'] < 0]

          W         X         Y         Z
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263

In [19]:
df[df['W']>0][['Y', 'X']]

          Y         X
A  0.184502  0.166905
B  0.329646  0.638787
D  1.996652  0.238127
E  0.000366 -1.136645

In [22]:
boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.184502  0.166905
B  0.329646  0.638787
D  1.996652  0.238127
E  0.000366 -1.136645

In [23]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
D  1.901755  0.238127  1.996652 -0.993263

In [24]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [25]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [26]:
newid = 'CA NY WY OR CO'.split()

In [27]:
newid

['CA', 'NY', 'WY', 'OR', 'CO']

In [28]:
df['States'] = newid

In [29]:
df

          W         X         Y         Z States
A  0.390528  0.166905  0.184502  0.807706     CA
B  0.072960  0.638787  0.329646 -0.497104     NY
C -0.754070 -0.943406  0.484752 -0.116773     WY
D  1.901755  0.238127  1.996652 -0.993263     OR
E  0.196800 -1.136645  0.000366  1.025984     CO

In [30]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.390528  0.166905  0.184502  0.807706
NY      0.072960  0.638787  0.329646 -0.497104
WY     -0.754070 -0.943406  0.484752 -0.116773
OR      1.901755  0.238127  1.996652 -0.993263
CO      0.196800 -1.136645  0.000366  1.025984